# 初级班报名表

请认真、如实、详细填写如下报名信息。
同时，为了避免您个人信息泄露，我们尽可能地避免让您填写过于隐私的信息

## 个人简介

（必填）姓名（若担心隐私问题可填写昵称）：吴雪兰
（必填）学校：黑龙江大学
（必填）专业：软件工程
（必填）毕业时间：2016.9
（必填）学历：本科在读
（选填）家庭居住城市：石家庄
（选填）未来期望工作城市：北京，天津

## 联系方式

（必填）Email：709925695@qq.com
（选填）联系电话：15244686426
（选填）QQ：709925695

## 关于前端

（必填）什么时候开始接触前端？因何接触？
        从大学二年级开始接触，因为选修了asp.net课程，开始做小的网页，我一下子就喜欢上了这门技术。

（必填）你理解的前端是做些什么事情？
       是运用html,css,js,php等的前端技术开发web网页，对网页进行排版，编辑和 添加各种交互，使我们的网页更加的美观，更加的实用。

（必填）你为什么要学习前端？
        本来我也是软件工程专业，对于计算机软件行业有些了解，观察了职业的职责和水平，发现对web前端我还是有兴趣的，因为我本身就喜欢漂亮的东西，通过做asp.net的小实验，发现自己做好一个漂亮的网页比我编出一个程序让我更有成就感，心情会更加的舒畅，所以决定要学习前端。
（必填）你自我评价当前你的前端技术能力如何，可以举一些详细的例子来描述能力水平
      我也不知道现在算不算是前端技术，我自学了html的相关内容，可以用asp.net做出简单的网页，比如设计简单的网页格局，插入文本框，各种标签，按钮，转入其他页面等。虽然现在技术知识少，但我对前端有着极大的学习热情，我期待可以做出漂亮实用的网页。

