# 中级班报名表

请认真、如实、详细填写如下报名信息。
同时，为了避免您个人信息泄露，我们尽可能地避免让您填写过于隐私的信息

## 个人简介

（必填）姓名（若担心隐私问题可填写昵称）：曾学兵
（必填）学校：西南大学
（必填）专业：软件工程
（必填）毕业时间：2016年8月
（必填）学历：大学本科
（选填）家庭居住城市：四川省邛崃市
（选填）未来期望工作城市：成都市，能离家近最好。远也可以接受。

## 联系方式

（必填）Email：1040837223@qq.com
（选填）联系电话：13102345369
（选填）QQ：1040837223

## 关于前端

（必填）什么时候开始接触前端？因何接触？
    时间：2014年9月
    原因：当时有一门课的老师自己开了一个公司，需要人手做前段，我就抱着试一试的心态去。结果发现自己很喜欢。然后就开始逐渐自己去了解和熟悉一些前端的技术。

（必填）你理解的前端是做些什么事情？
    我所理解的前端是，把想要展示给浏览者的信息用前端的语言描绘出来，并且是生动形象的。将一些复杂的数据也用图形化或者方便用户接收的方式向用户传递。
    并且前端还要处理用户的输入数据和后台的数据。所以前端就是把用户和数据之间的一座桥梁。

（必填）你为什么要学习前端？
    我喜欢前端的原因或许是前段不仅能做出非常酷炫的效果，而且它是用户常常直接能看到的。做出一个酷炫的东西给用户我觉得是非常有成就感的一件事情。
    有时候会因为自己做了一个酷炫的效果（自己认为）而开心。并且我自己也了解过，前端就业方面也比较不错。

（必填）介绍一个你做过的最复杂的前端项目，其中遇到最困难的技术问题是什么，你如何解决的？
    五个月前，我的项目是在Moodle平台上，以老师课程为主，完成这门课的网上学习课程。期间我遇到了一个BUG，就是在学习页面，点击视屏按钮，弹出视屏后，
    原来的文字收缩失效。当时我先是去百度这个问题，但是网上没有这个方面的问题，然后我就自己测试。把事件的绑定方式换一种方法，可是还是没有头绪。
    最后我在我加入的前端群里面发Demo向前辈请教才知道原来只是后面的绑定的时间覆盖了前面的时间。就觉得自己基础差的太多，就又从头学习了一边JavaScript.
    
（必填）你自我评价当前你的前端技术能力如何，可以举一些详细的例子来描述能力水平
    1.HTML 常用标签比较熟悉，不常用的会有一些印象。
    2.HTML5 简单了解过。但是没用过。
    3.CSS 对于CSS 的常用属性基本都知道，不常用的属性了解，用的时候会再去查
    4.CSS3 比教了解。对其中的过渡属性熟悉，对其中的2D 3D 转换十分感兴趣，自学过。但是不精通。
    5.JavaScript 熟悉，JavaScript 中对于页面元素的操作基本都很熟悉，但是对于一些比较难的例如闭包和原型都不太了解。
    6.AJAX 自学过。自己简单按照教程成功完成过数据交互。
    7.JQuery 简单了解过，觉得功能很强大。但是本质上还是JavaScript ，所以我目前还是侧重学习JavaScript。
    8.Bootstrap 了解并且在网上自学过。
    
    总体评价： 给我一个静态页面的UI图，我能按照需求基本完成。并且做得过程中会尽量模块化保证修改和扩展方便。idm和CSS的命名都会尽量语意话。但是对于CSS代码不是很精简是我目前的问题。
             对于页面上的一些需要JavaScript 的效果也能解决，同时做的过程中也会做到JS 代码的扩展性和易修改性。并且可以做到HTML CSS JavaScript 三者分离。
    
    我做过的东西：做过一个自定义的滚动条，同时把函数封装之后能重用到其他需要滚动条的元素中。
                做过一个可以拖拽的小视屏播放窗口。
                做过左右滑动切换的轮播图和视屏列表
